ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/* -------- DMAC_BTCNT : (DMAC Offset: 0x02) (R/W 16) Block Transfer Count -------- */
#define DMAC_BTCNT_BTCNT_Pos _UINT16_(0) /* (DMAC_BTCNT) Block Transfer Count Position */
#define DMAC_BTCNT_BTCNT_Msk (_UINT16_(0xFFFF) << DMAC_BTCNT_BTCNT_Pos) /* (DMAC_BTCNT) Block Transfer Count Mask */
#define DMAC_BTCNT_BTCNT(value)                                                                                        \
        (DMAC_BTCNT_BTCNT_Msk &                                                                                        \
         (_UINT16_(value) << DMAC_BTCNT_BTCNT_Pos)) /* Assigment of value for BTCNT in the DMAC_BTCNT register */
#define DMAC_BTCNT_Msk _UINT16_(0xFFFF) /* (DMAC_BTCNT) Register Mask  */


/* -------- DMAC_SRCADDR : (DMAC Offset: 0x04) (R/W 32) Block Transfer Source Address -------- */
#define DMAC_SRCADDR_SRCADDR_Pos _UINT32_(0) /* (DMAC_SRCADDR) Transfer Source Address Position */
#define DMAC_SRCADDR_SRCADDR_Msk                                                                                       \
        (_UINT32_(0xFFFFFFFF) << DMAC_SRCADDR_SRCADDR_Pos) /* (DMAC_SRCADDR) Transfer Source Address Mask */
#define DMAC_SRCADDR_SRCADDR(value)                                                                                    \
        (DMAC_SRCADDR_SRCADDR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_SRCADDR_SRCADDR_Pos)) /* Assigment of value for SRCADDR in the DMAC_SRCADDR register */
#define DMAC_SRCADDR_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_SRCADDR) Register Mask  */


/* -------- DMAC_DSTADDR : (DMAC Offset: 0x08) (R/W 32) Block Transfer Destination Address -------- */
#define DMAC_DSTADDR_DSTADDR_Pos _UINT32_(0) /* (DMAC_DSTADDR) Transfer Destination Address Position */
#define DMAC_DSTADDR_DSTADDR_Msk                                                                                       \
        (_UINT32_(0xFFFFFFFF) << DMAC_DSTADDR_DSTADDR_Pos) /* (DMAC_DSTADDR) Transfer Destination Address Mask */
#define DMAC_DSTADDR_DSTADDR(value)                                                                                    \
        (DMAC_DSTADDR_DSTADDR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_DSTADDR_DSTADDR_Pos)) /* Assigment of value for DSTADDR in the DMAC_DSTADDR register */
#define DMAC_DSTADDR_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_DSTADDR) Register Mask  */


/* -------- DMAC_DESCADDR : (DMAC Offset: 0x0C) (R/W 32) Next Descriptor Address -------- */
#define DMAC_DESCADDR_DESCADDR_Pos _UINT32_(0) /* (DMAC_DESCADDR) Next Descriptor Address Position */
#define DMAC_DESCADDR_DESCADDR_Msk                                                                                     \
        (_UINT32_(0xFFFFFFFF) << DMAC_DESCADDR_DESCADDR_Pos) /* (DMAC_DESCADDR) Next Descriptor Address Mask */
#define DMAC_DESCADDR_DESCADDR(value)                                                                                  \
        (DMAC_DESCADDR_DESCADDR_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << DMAC_DESCADDR_DESCADDR_Pos)) /* Assigment of value for DESCADDR in the DMAC_DESCADDR register */
#define DMAC_DESCADDR_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_DESCADDR) Register Mask  */


/* -------- DMAC_CTRL : (DMAC Offset: 0x00) (R/W 16) Control -------- */
#define DMAC_CTRL_RESETVALUE _UINT16_(0x00) /*  (DMAC_CTRL) Control  Reset Value */

#define DMAC_CTRL_SWRST_Pos _UINT16_(0) /* (DMAC_CTRL) Software Reset Position */
#define DMAC_CTRL_SWRST_Msk (_UINT16_(0x1) << DMAC_CTRL_SWRST_Pos) /* (DMAC_CTRL) Software Reset Mask */
#define DMAC_CTRL_SWRST(value)                                                                                         \
        (DMAC_CTRL_SWRST_Msk &                                                                                         \
         (_UINT16_(value) << DMAC_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the DMAC_CTRL register */
#define DMAC_CTRL_DMAENABLE_Pos _UINT16_(1) /* (DMAC_CTRL) DMA Enable Position */
#define DMAC_CTRL_DMAENABLE_Msk (_UINT16_(0x1) << DMAC_CTRL_DMAENABLE_Pos) /* (DMAC_CTRL) DMA Enable Mask */
#define DMAC_CTRL_DMAENABLE(value)                                                                                     \
        (DMAC_CTRL_DMAENABLE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << DMAC_CTRL_DMAENABLE_Pos)) /* Assigment of value for DMAENABLE in the DMAC_CTRL register */
#define DMAC_CTRL_CRCENABLE_Pos _UINT16_(2) /* (DMAC_CTRL) CRC Enable Position */
#define DMAC_CTRL_CRCENABLE_Msk (_UINT16_(0x1) << DMAC_CTRL_CRCENABLE_Pos) /* (DMAC_CTRL) CRC Enable Mask */
#define DMAC_CTRL_CRCENABLE(value)                                                                                     \
        (DMAC_CTRL_CRCENABLE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << DMAC_CTRL_CRCENABLE_Pos)) /* Assigment of value for CRCENABLE in the DMAC_CTRL register */
#define DMAC_CTRL_LVLEN0_Pos _UINT16_(8) /* (DMAC_CTRL) Priority Level 0 Enable Position */
#define DMAC_CTRL_LVLEN0_Msk (_UINT16_(0x1) << DMAC_CTRL_LVLEN0_Pos) /* (DMAC_CTRL) Priority Level 0 Enable Mask */
#define DMAC_CTRL_LVLEN0(value)                                                                                        \
        (DMAC_CTRL_LVLEN0_Msk &                                                                                        \
         (_UINT16_(value) << DMAC_CTRL_LVLEN0_Pos)) /* Assigment of value for LVLEN0 in the DMAC_CTRL register */
#define DMAC_CTRL_LVLEN1_Pos _UINT16_(9) /* (DMAC_CTRL) Priority Level 1 Enable Position */
#define DMAC_CTRL_LVLEN1_Msk (_UINT16_(0x1) << DMAC_CTRL_LVLEN1_Pos) /* (DMAC_CTRL) Priority Level 1 Enable Mask */
#define DMAC_CTRL_LVLEN1(value)                                                                                        \
        (DMAC_CTRL_LVLEN1_Msk &                                                                                        \
         (_UINT16_(value) << DMAC_CTRL_LVLEN1_Pos)) /* Assigment of value for LVLEN1 in the DMAC_CTRL register */
#define DMAC_CTRL_LVLEN2_Pos _UINT16_(10) /* (DMAC_CTRL) Priority Level 2 Enable Position */
#define DMAC_CTRL_LVLEN2_Msk (_UINT16_(0x1) << DMAC_CTRL_LVLEN2_Pos) /* (DMAC_CTRL) Priority Level 2 Enable Mask */
#define DMAC_CTRL_LVLEN2(value)                                                                                        \
        (DMAC_CTRL_LVLEN2_Msk &                                                                                        \
         (_UINT16_(value) << DMAC_CTRL_LVLEN2_Pos)) /* Assigment of value for LVLEN2 in the DMAC_CTRL register */
#define DMAC_CTRL_LVLEN3_Pos _UINT16_(11) /* (DMAC_CTRL) Priority Level 3 Enable Position */
#define DMAC_CTRL_LVLEN3_Msk (_UINT16_(0x1) << DMAC_CTRL_LVLEN3_Pos) /* (DMAC_CTRL) Priority Level 3 Enable Mask */
#define DMAC_CTRL_LVLEN3(value)                                                                                        \
        (DMAC_CTRL_LVLEN3_Msk &                                                                                        \
         (_UINT16_(value) << DMAC_CTRL_LVLEN3_Pos)) /* Assigment of value for LVLEN3 in the DMAC_CTRL register */
#define DMAC_CTRL_Msk _UINT16_(0x0F07) /* (DMAC_CTRL) Register Mask  */

