ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
#define DMAC_CTRL_LVLEN_Pos _UINT16_(8) /* (DMAC_CTRL Position) Priority Level 3 Enable */
#define DMAC_CTRL_LVLEN_Msk (_UINT16_(0xF) << DMAC_CTRL_LVLEN_Pos) /* (DMAC_CTRL Mask) LVLEN */
#define DMAC_CTRL_LVLEN(value) (DMAC_CTRL_LVLEN_Msk & (_UINT16_(value) << DMAC_CTRL_LVLEN_Pos))

/* -------- DMAC_CRCCTRL : (DMAC Offset: 0x02) (R/W 16) CRC Control -------- */
#define DMAC_CRCCTRL_RESETVALUE _UINT16_(0x00) /*  (DMAC_CRCCTRL) CRC Control  Reset Value */

#define DMAC_CRCCTRL_CRCBEATSIZE_Pos _UINT16_(0) /* (DMAC_CRCCTRL) CRC Beat Size Position */
#define DMAC_CRCCTRL_CRCBEATSIZE_Msk                                                                                   \
        (_UINT16_(0x3) << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) CRC Beat Size Mask */
#define DMAC_CRCCTRL_CRCBEATSIZE(value)                                                                                \
        (DMAC_CRCCTRL_CRCBEATSIZE_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << DMAC_CRCCTRL_CRCBEATSIZE_Pos)) /* Assigment of value for CRCBEATSIZE in the DMAC_CRCCTRL register */
#define DMAC_CRCCTRL_CRCBEATSIZE_BYTE_Val _UINT16_(0x0) /* (DMAC_CRCCTRL) 8-bit bus transfer  */
#define DMAC_CRCCTRL_CRCBEATSIZE_HWORD_Val _UINT16_(0x1) /* (DMAC_CRCCTRL) 16-bit bus transfer  */
#define DMAC_CRCCTRL_CRCBEATSIZE_WORD_Val _UINT16_(0x2) /* (DMAC_CRCCTRL) 32-bit bus transfer  */
#define DMAC_CRCCTRL_CRCBEATSIZE_BYTE                                                                                  \
        (DMAC_CRCCTRL_CRCBEATSIZE_BYTE_Val                                                                             \
         << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 8-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCBEATSIZE_HWORD                                                                                 \
        (DMAC_CRCCTRL_CRCBEATSIZE_HWORD_Val                                                                            \
         << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 16-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCBEATSIZE_WORD                                                                                  \
        (DMAC_CRCCTRL_CRCBEATSIZE_WORD_Val                                                                             \
         << DMAC_CRCCTRL_CRCBEATSIZE_Pos) /* (DMAC_CRCCTRL) 32-bit bus transfer Position  */
#define DMAC_CRCCTRL_CRCPOLY_Pos _UINT16_(2) /* (DMAC_CRCCTRL) CRC Polynomial Type Position */
#define DMAC_CRCCTRL_CRCPOLY_Msk                                                                                       \
        (_UINT16_(0x3) << DMAC_CRCCTRL_CRCPOLY_Pos) /* (DMAC_CRCCTRL) CRC Polynomial Type Mask */
#define DMAC_CRCCTRL_CRCPOLY(value)                                                                                    \
        (DMAC_CRCCTRL_CRCPOLY_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << DMAC_CRCCTRL_CRCPOLY_Pos)) /* Assigment of value for CRCPOLY in the DMAC_CRCCTRL register */
#define DMAC_CRCCTRL_CRCPOLY_CRC16_Val _UINT16_(0x0) /* (DMAC_CRCCTRL) CRC-16 (CRC-CCITT)  */
#define DMAC_CRCCTRL_CRCPOLY_CRC32_Val _UINT16_(0x1) /* (DMAC_CRCCTRL) CRC32 (IEEE 802.3)  */
#define DMAC_CRCCTRL_CRCPOLY_CRC16                                                                                     \
        (DMAC_CRCCTRL_CRCPOLY_CRC16_Val << DMAC_CRCCTRL_CRCPOLY_Pos) /* (DMAC_CRCCTRL) CRC-16 (CRC-CCITT) Position  */
#define DMAC_CRCCTRL_CRCPOLY_CRC32                                                                                     \
        (DMAC_CRCCTRL_CRCPOLY_CRC32_Val << DMAC_CRCCTRL_CRCPOLY_Pos) /* (DMAC_CRCCTRL) CRC32 (IEEE 802.3) Position  */
#define DMAC_CRCCTRL_CRCSRC_Pos _UINT16_(8) /* (DMAC_CRCCTRL) CRC Input Source Position */
#define DMAC_CRCCTRL_CRCSRC_Msk (_UINT16_(0x3F) << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) CRC Input Source Mask */
#define DMAC_CRCCTRL_CRCSRC(value)                                                                                     \
        (DMAC_CRCCTRL_CRCSRC_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << DMAC_CRCCTRL_CRCSRC_Pos)) /* Assigment of value for CRCSRC in the DMAC_CRCCTRL register */
#define DMAC_CRCCTRL_CRCSRC_NOACT_Val _UINT16_(0x0) /* (DMAC_CRCCTRL) No action  */
#define DMAC_CRCCTRL_CRCSRC_IO_Val _UINT16_(0x1) /* (DMAC_CRCCTRL) I/O interface  */
#define DMAC_CRCCTRL_CRCSRC_NOACT                                                                                      \
        (DMAC_CRCCTRL_CRCSRC_NOACT_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) No action Position  */
#define DMAC_CRCCTRL_CRCSRC_IO                                                                                         \
        (DMAC_CRCCTRL_CRCSRC_IO_Val << DMAC_CRCCTRL_CRCSRC_Pos) /* (DMAC_CRCCTRL) I/O interface Position  */
#define DMAC_CRCCTRL_Msk _UINT16_(0x3F0F) /* (DMAC_CRCCTRL) Register Mask  */


/* -------- DMAC_CRCDATAIN : (DMAC Offset: 0x04) (R/W 32) CRC Data Input -------- */
#define DMAC_CRCDATAIN_RESETVALUE _UINT32_(0x00) /*  (DMAC_CRCDATAIN) CRC Data Input  Reset Value */

#define DMAC_CRCDATAIN_CRCDATAIN_Pos _UINT32_(0) /* (DMAC_CRCDATAIN) CRC Data Input Position */
#define DMAC_CRCDATAIN_CRCDATAIN_Msk                                                                                   \
        (_UINT32_(0xFFFFFFFF) << DMAC_CRCDATAIN_CRCDATAIN_Pos) /* (DMAC_CRCDATAIN) CRC Data Input Mask */
#define DMAC_CRCDATAIN_CRCDATAIN(value)                                                                                \
        (DMAC_CRCDATAIN_CRCDATAIN_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << DMAC_CRCDATAIN_CRCDATAIN_Pos)) /* Assigment of value for CRCDATAIN in the DMAC_CRCDATAIN register */
#define DMAC_CRCDATAIN_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_CRCDATAIN) Register Mask  */


