ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/* -------- DMAC_CRCCHKSUM : (DMAC Offset: 0x08) (R/W 32) CRC Checksum -------- */
#define DMAC_CRCCHKSUM_RESETVALUE _UINT32_(0x00) /*  (DMAC_CRCCHKSUM) CRC Checksum  Reset Value */

#define DMAC_CRCCHKSUM_CRCCHKSUM_Pos _UINT32_(0) /* (DMAC_CRCCHKSUM) CRC Checksum Position */
#define DMAC_CRCCHKSUM_CRCCHKSUM_Msk                                                                                   \
        (_UINT32_(0xFFFFFFFF) << DMAC_CRCCHKSUM_CRCCHKSUM_Pos) /* (DMAC_CRCCHKSUM) CRC Checksum Mask */
#define DMAC_CRCCHKSUM_CRCCHKSUM(value)                                                                                \
        (DMAC_CRCCHKSUM_CRCCHKSUM_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << DMAC_CRCCHKSUM_CRCCHKSUM_Pos)) /* Assigment of value for CRCCHKSUM in the DMAC_CRCCHKSUM register */
#define DMAC_CRCCHKSUM_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_CRCCHKSUM) Register Mask  */


/* -------- DMAC_CRCSTATUS : (DMAC Offset: 0x0C) (R/W 8) CRC Status -------- */
#define DMAC_CRCSTATUS_RESETVALUE _UINT8_(0x00) /*  (DMAC_CRCSTATUS) CRC Status  Reset Value */

#define DMAC_CRCSTATUS_CRCBUSY_Pos _UINT8_(0) /* (DMAC_CRCSTATUS) CRC Module Busy Position */
#define DMAC_CRCSTATUS_CRCBUSY_Msk                                                                                     \
        (_UINT8_(0x1) << DMAC_CRCSTATUS_CRCBUSY_Pos) /* (DMAC_CRCSTATUS) CRC Module Busy Mask */
#define DMAC_CRCSTATUS_CRCBUSY(value)                                                                                  \
        (DMAC_CRCSTATUS_CRCBUSY_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << DMAC_CRCSTATUS_CRCBUSY_Pos)) /* Assigment of value for CRCBUSY in the DMAC_CRCSTATUS register */
#define DMAC_CRCSTATUS_CRCZERO_Pos _UINT8_(1) /* (DMAC_CRCSTATUS) CRC Zero Position */
#define DMAC_CRCSTATUS_CRCZERO_Msk (_UINT8_(0x1) << DMAC_CRCSTATUS_CRCZERO_Pos) /* (DMAC_CRCSTATUS) CRC Zero Mask */
#define DMAC_CRCSTATUS_CRCZERO(value)                                                                                  \
        (DMAC_CRCSTATUS_CRCZERO_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << DMAC_CRCSTATUS_CRCZERO_Pos)) /* Assigment of value for CRCZERO in the DMAC_CRCSTATUS register */
#define DMAC_CRCSTATUS_Msk _UINT8_(0x03) /* (DMAC_CRCSTATUS) Register Mask  */


/* -------- DMAC_DBGCTRL : (DMAC Offset: 0x0D) (R/W 8) Debug Control -------- */
#define DMAC_DBGCTRL_RESETVALUE _UINT8_(0x00) /*  (DMAC_DBGCTRL) Debug Control  Reset Value */

#define DMAC_DBGCTRL_DBGRUN_Pos _UINT8_(0) /* (DMAC_DBGCTRL) Debug Run Position */
#define DMAC_DBGCTRL_DBGRUN_Msk (_UINT8_(0x1) << DMAC_DBGCTRL_DBGRUN_Pos) /* (DMAC_DBGCTRL) Debug Run Mask */
#define DMAC_DBGCTRL_DBGRUN(value)                                                                                     \
        (DMAC_DBGCTRL_DBGRUN_Msk &                                                                                     \
         (_UINT8_(value) << DMAC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the DMAC_DBGCTRL register */
#define DMAC_DBGCTRL_Msk _UINT8_(0x01) /* (DMAC_DBGCTRL) Register Mask  */


/* -------- DMAC_QOSCTRL : (DMAC Offset: 0x0E) (R/W 8) QOS Control -------- */
#define DMAC_QOSCTRL_RESETVALUE _UINT8_(0x15) /*  (DMAC_QOSCTRL) QOS Control  Reset Value */

#define DMAC_QOSCTRL_WRBQOS_Pos _UINT8_(0) /* (DMAC_QOSCTRL) Write-Back Quality of Service Position */
#define DMAC_QOSCTRL_WRBQOS_Msk                                                                                        \
        (_UINT8_(0x3) << DMAC_QOSCTRL_WRBQOS_Pos) /* (DMAC_QOSCTRL) Write-Back Quality of Service Mask */
#define DMAC_QOSCTRL_WRBQOS(value)                                                                                     \
        (DMAC_QOSCTRL_WRBQOS_Msk &                                                                                     \
         (_UINT8_(value) << DMAC_QOSCTRL_WRBQOS_Pos)) /* Assigment of value for WRBQOS in the DMAC_QOSCTRL register */
#define DMAC_QOSCTRL_WRBQOS_DISABLE_Val _UINT8_(0x0) /* (DMAC_QOSCTRL) Background (no sensitive operation)  */
#define DMAC_QOSCTRL_WRBQOS_LOW_Val _UINT8_(0x1) /* (DMAC_QOSCTRL) Sensitive Bandwidth  */
#define DMAC_QOSCTRL_WRBQOS_MEDIUM_Val _UINT8_(0x2) /* (DMAC_QOSCTRL) Sensitive Latency  */
#define DMAC_QOSCTRL_WRBQOS_HIGH_Val _UINT8_(0x3) /* (DMAC_QOSCTRL) Critical Latency  */
#define DMAC_QOSCTRL_WRBQOS_DISABLE                                                                                    \
        (                                                                                                              \
                DMAC_QOSCTRL_WRBQOS_DISABLE_Val                                                                        \
                << DMAC_QOSCTRL_WRBQOS_Pos) /* (DMAC_QOSCTRL) Background (no sensitive operation) Position  */
#define DMAC_QOSCTRL_WRBQOS_LOW                                                                                        \
        (DMAC_QOSCTRL_WRBQOS_LOW_Val << DMAC_QOSCTRL_WRBQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Bandwidth Position  */
#define DMAC_QOSCTRL_WRBQOS_MEDIUM                                                                                     \
        (DMAC_QOSCTRL_WRBQOS_MEDIUM_Val << DMAC_QOSCTRL_WRBQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Latency Position  */
#define DMAC_QOSCTRL_WRBQOS_HIGH                                                                                       \
        (DMAC_QOSCTRL_WRBQOS_HIGH_Val << DMAC_QOSCTRL_WRBQOS_Pos) /* (DMAC_QOSCTRL) Critical Latency Position  */
#define DMAC_QOSCTRL_FQOS_Pos _UINT8_(2) /* (DMAC_QOSCTRL) Fetch Quality of Service Position */
#define DMAC_QOSCTRL_FQOS_Msk (_UINT8_(0x3) << DMAC_QOSCTRL_FQOS_Pos) /* (DMAC_QOSCTRL) Fetch Quality of Service Mask  \
                                                                       */
#define DMAC_QOSCTRL_FQOS(value)                                                                                       \
        (DMAC_QOSCTRL_FQOS_Msk &                                                                                       \
         (_UINT8_(value) << DMAC_QOSCTRL_FQOS_Pos)) /* Assigment of value for FQOS in the DMAC_QOSCTRL register */
#define DMAC_QOSCTRL_FQOS_DISABLE_Val _UINT8_(0x0) /* (DMAC_QOSCTRL) Background (no sensitive operation)  */
#define DMAC_QOSCTRL_FQOS_LOW_Val _UINT8_(0x1) /* (DMAC_QOSCTRL) Sensitive Bandwidth  */
#define DMAC_QOSCTRL_FQOS_MEDIUM_Val _UINT8_(0x2) /* (DMAC_QOSCTRL) Sensitive Latency  */
#define DMAC_QOSCTRL_FQOS_HIGH_Val _UINT8_(0x3) /* (DMAC_QOSCTRL) Critical Latency  */
#define DMAC_QOSCTRL_FQOS_DISABLE                                                                                      \
        (                                                                                                              \
                DMAC_QOSCTRL_FQOS_DISABLE_Val                                                                          \
                << DMAC_QOSCTRL_FQOS_Pos) /* (DMAC_QOSCTRL) Background (no sensitive operation) Position  */
#define DMAC_QOSCTRL_FQOS_LOW                                                                                          \
        (DMAC_QOSCTRL_FQOS_LOW_Val << DMAC_QOSCTRL_FQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Bandwidth Position  */
#define DMAC_QOSCTRL_FQOS_MEDIUM                                                                                       \
        (DMAC_QOSCTRL_FQOS_MEDIUM_Val << DMAC_QOSCTRL_FQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Latency Position  */
#define DMAC_QOSCTRL_FQOS_HIGH                                                                                         \
        (DMAC_QOSCTRL_FQOS_HIGH_Val << DMAC_QOSCTRL_FQOS_Pos) /* (DMAC_QOSCTRL) Critical Latency Position  */
#define DMAC_QOSCTRL_DQOS_Pos _UINT8_(4) /* (DMAC_QOSCTRL) Data Transfer Quality of Service Position */
#define DMAC_QOSCTRL_DQOS_Msk                                                                                          \
        (_UINT8_(0x3) << DMAC_QOSCTRL_DQOS_Pos) /* (DMAC_QOSCTRL) Data Transfer Quality of Service Mask */
#define DMAC_QOSCTRL_DQOS(value)                                                                                       \
        (DMAC_QOSCTRL_DQOS_Msk &                                                                                       \
         (_UINT8_(value) << DMAC_QOSCTRL_DQOS_Pos)) /* Assigment of value for DQOS in the DMAC_QOSCTRL register */
#define DMAC_QOSCTRL_DQOS_DISABLE_Val _UINT8_(0x0) /* (DMAC_QOSCTRL) Background (no sensitive operation)  */
#define DMAC_QOSCTRL_DQOS_LOW_Val _UINT8_(0x1) /* (DMAC_QOSCTRL) Sensitive Bandwidth  */
#define DMAC_QOSCTRL_DQOS_MEDIUM_Val _UINT8_(0x2) /* (DMAC_QOSCTRL) Sensitive Latency  */
#define DMAC_QOSCTRL_DQOS_HIGH_Val _UINT8_(0x3) /* (DMAC_QOSCTRL) Critical Latency  */
#define DMAC_QOSCTRL_DQOS_DISABLE                                                                                      \
        (                                                                                                              \
                DMAC_QOSCTRL_DQOS_DISABLE_Val                                                                          \
                << DMAC_QOSCTRL_DQOS_Pos) /* (DMAC_QOSCTRL) Background (no sensitive operation) Position  */
#define DMAC_QOSCTRL_DQOS_LOW                                                                                          \
        (DMAC_QOSCTRL_DQOS_LOW_Val << DMAC_QOSCTRL_DQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Bandwidth Position  */
#define DMAC_QOSCTRL_DQOS_MEDIUM                                                                                       \
        (DMAC_QOSCTRL_DQOS_MEDIUM_Val << DMAC_QOSCTRL_DQOS_Pos) /* (DMAC_QOSCTRL) Sensitive Latency Position  */
#define DMAC_QOSCTRL_DQOS_HIGH                                                                                         \
        (DMAC_QOSCTRL_DQOS_HIGH_Val << DMAC_QOSCTRL_DQOS_Pos) /* (DMAC_QOSCTRL) Critical Latency Position  */
#define DMAC_QOSCTRL_Msk _UINT8_(0x3F) /* (DMAC_QOSCTRL) Register Mask  */


/* -------- DMAC_SWTRIGCTRL : (DMAC Offset: 0x10) (R/W 32) Software Trigger Control -------- */
#define DMAC_SWTRIGCTRL_RESETVALUE _UINT32_(0x00) /*  (DMAC_SWTRIGCTRL) Software Trigger Control  Reset Value */

#define DMAC_SWTRIGCTRL_SWTRIG0_Pos _UINT32_(0) /* (DMAC_SWTRIGCTRL) Channel 0 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG0_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG0_Pos) /* (DMAC_SWTRIGCTRL) Channel 0 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG0(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG0_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG0_Pos)) /* Assigment of value for SWTRIG0 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG1_Pos _UINT32_(1) /* (DMAC_SWTRIGCTRL) Channel 1 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG1_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG1_Pos) /* (DMAC_SWTRIGCTRL) Channel 1 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG1(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG1_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG1_Pos)) /* Assigment of value for SWTRIG1 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG2_Pos _UINT32_(2) /* (DMAC_SWTRIGCTRL) Channel 2 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG2_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG2_Pos) /* (DMAC_SWTRIGCTRL) Channel 2 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG2(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG2_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG2_Pos)) /* Assigment of value for SWTRIG2 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG3_Pos _UINT32_(3) /* (DMAC_SWTRIGCTRL) Channel 3 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG3_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG3_Pos) /* (DMAC_SWTRIGCTRL) Channel 3 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG3(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG3_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG3_Pos)) /* Assigment of value for SWTRIG3 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG4_Pos _UINT32_(4) /* (DMAC_SWTRIGCTRL) Channel 4 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG4_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG4_Pos) /* (DMAC_SWTRIGCTRL) Channel 4 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG4(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG4_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG4_Pos)) /* Assigment of value for SWTRIG4 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG5_Pos _UINT32_(5) /* (DMAC_SWTRIGCTRL) Channel 5 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG5_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG5_Pos) /* (DMAC_SWTRIGCTRL) Channel 5 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG5(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG5_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG5_Pos)) /* Assigment of value for SWTRIG5 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG6_Pos _UINT32_(6) /* (DMAC_SWTRIGCTRL) Channel 6 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG6_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG6_Pos) /* (DMAC_SWTRIGCTRL) Channel 6 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG6(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG6_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG6_Pos)) /* Assigment of value for SWTRIG6 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG7_Pos _UINT32_(7) /* (DMAC_SWTRIGCTRL) Channel 7 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG7_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG7_Pos) /* (DMAC_SWTRIGCTRL) Channel 7 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG7(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG7_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG7_Pos)) /* Assigment of value for SWTRIG7 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG8_Pos _UINT32_(8) /* (DMAC_SWTRIGCTRL) Channel 8 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG8_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG8_Pos) /* (DMAC_SWTRIGCTRL) Channel 8 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG8(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG8_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG8_Pos)) /* Assigment of value for SWTRIG8 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG9_Pos _UINT32_(9) /* (DMAC_SWTRIGCTRL) Channel 9 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG9_Msk                                                                                    \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG9_Pos) /* (DMAC_SWTRIGCTRL) Channel 9 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG9(value)                                                                                 \
        (DMAC_SWTRIGCTRL_SWTRIG9_Msk &                                                                                 \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG9_Pos)) /* Assigment of value for SWTRIG9 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG10_Pos _UINT32_(10) /* (DMAC_SWTRIGCTRL) Channel 10 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG10_Msk                                                                                   \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG10_Pos) /* (DMAC_SWTRIGCTRL) Channel 10 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG10(value)                                                                                \
        (DMAC_SWTRIGCTRL_SWTRIG10_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG10_Pos)) /* Assigment of value for SWTRIG10 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_SWTRIG11_Pos _UINT32_(11) /* (DMAC_SWTRIGCTRL) Channel 11 Software Trigger Position */
#define DMAC_SWTRIGCTRL_SWTRIG11_Msk                                                                                   \
        (_UINT32_(0x1) << DMAC_SWTRIGCTRL_SWTRIG11_Pos) /* (DMAC_SWTRIGCTRL) Channel 11 Software Trigger Mask */
#define DMAC_SWTRIGCTRL_SWTRIG11(value)                                                                                \
        (DMAC_SWTRIGCTRL_SWTRIG11_Msk &                                                                                \
         (_UINT32_(value)                                                                                              \
          << DMAC_SWTRIGCTRL_SWTRIG11_Pos)) /* Assigment of value for SWTRIG11 in the DMAC_SWTRIGCTRL register */
#define DMAC_SWTRIGCTRL_Msk _UINT32_(0x00000FFF) /* (DMAC_SWTRIGCTRL) Register Mask  */

#define DMAC_SWTRIGCTRL_SWTRIG_Pos _UINT32_(0) /* (DMAC_SWTRIGCTRL Position) Channel xx Software Trigger */
#define DMAC_SWTRIGCTRL_SWTRIG_Msk (_UINT32_(0xFFF) << DMAC_SWTRIGCTRL_SWTRIG_Pos) /* (DMAC_SWTRIGCTRL Mask) SWTRIG */
#define DMAC_SWTRIGCTRL_SWTRIG(value) (DMAC_SWTRIGCTRL_SWTRIG_Msk & (_UINT32_(value) << DMAC_SWTRIGCTRL_SWTRIG_Pos))

/* -------- DMAC_PRICTRL0 : (DMAC Offset: 0x14) (R/W 32) Priority Control 0 -------- */
#define DMAC_PRICTRL0_RESETVALUE _UINT32_(0x00) /*  (DMAC_PRICTRL0) Priority Control 0  Reset Value */

