ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/* -------- DMAC_INTPEND : (DMAC Offset: 0x20) (R/W 16) Interrupt Pending -------- */
#define DMAC_INTPEND_RESETVALUE _UINT16_(0x00) /*  (DMAC_INTPEND) Interrupt Pending  Reset Value */

#define DMAC_INTPEND_ID_Pos _UINT16_(0) /* (DMAC_INTPEND) Channel ID Position */
#define DMAC_INTPEND_ID_Msk (_UINT16_(0xF) << DMAC_INTPEND_ID_Pos) /* (DMAC_INTPEND) Channel ID Mask */
#define DMAC_INTPEND_ID(value)                                                                                         \
        (DMAC_INTPEND_ID_Msk &                                                                                         \
         (_UINT16_(value) << DMAC_INTPEND_ID_Pos)) /* Assigment of value for ID in the DMAC_INTPEND register */
#define DMAC_INTPEND_TERR_Pos _UINT16_(8) /* (DMAC_INTPEND) Transfer Error Position */
#define DMAC_INTPEND_TERR_Msk (_UINT16_(0x1) << DMAC_INTPEND_TERR_Pos) /* (DMAC_INTPEND) Transfer Error Mask */
#define DMAC_INTPEND_TERR(value)                                                                                       \
        (DMAC_INTPEND_TERR_Msk &                                                                                       \
         (_UINT16_(value) << DMAC_INTPEND_TERR_Pos)) /* Assigment of value for TERR in the DMAC_INTPEND register */
#define DMAC_INTPEND_TCMPL_Pos _UINT16_(9) /* (DMAC_INTPEND) Transfer Complete Position */
#define DMAC_INTPEND_TCMPL_Msk (_UINT16_(0x1) << DMAC_INTPEND_TCMPL_Pos) /* (DMAC_INTPEND) Transfer Complete Mask */
#define DMAC_INTPEND_TCMPL(value)                                                                                      \
        (DMAC_INTPEND_TCMPL_Msk &                                                                                      \
         (_UINT16_(value) << DMAC_INTPEND_TCMPL_Pos)) /* Assigment of value for TCMPL in the DMAC_INTPEND register */
#define DMAC_INTPEND_SUSP_Pos _UINT16_(10) /* (DMAC_INTPEND) Channel Suspend Position */
#define DMAC_INTPEND_SUSP_Msk (_UINT16_(0x1) << DMAC_INTPEND_SUSP_Pos) /* (DMAC_INTPEND) Channel Suspend Mask */
#define DMAC_INTPEND_SUSP(value)                                                                                       \
        (DMAC_INTPEND_SUSP_Msk &                                                                                       \
         (_UINT16_(value) << DMAC_INTPEND_SUSP_Pos)) /* Assigment of value for SUSP in the DMAC_INTPEND register */
#define DMAC_INTPEND_FERR_Pos _UINT16_(13) /* (DMAC_INTPEND) Fetch Error Position */
#define DMAC_INTPEND_FERR_Msk (_UINT16_(0x1) << DMAC_INTPEND_FERR_Pos) /* (DMAC_INTPEND) Fetch Error Mask */
#define DMAC_INTPEND_FERR(value)                                                                                       \
        (DMAC_INTPEND_FERR_Msk &                                                                                       \
         (_UINT16_(value) << DMAC_INTPEND_FERR_Pos)) /* Assigment of value for FERR in the DMAC_INTPEND register */
#define DMAC_INTPEND_BUSY_Pos _UINT16_(14) /* (DMAC_INTPEND) Busy Position */
#define DMAC_INTPEND_BUSY_Msk (_UINT16_(0x1) << DMAC_INTPEND_BUSY_Pos) /* (DMAC_INTPEND) Busy Mask */
#define DMAC_INTPEND_BUSY(value)                                                                                       \
        (DMAC_INTPEND_BUSY_Msk &                                                                                       \
         (_UINT16_(value) << DMAC_INTPEND_BUSY_Pos)) /* Assigment of value for BUSY in the DMAC_INTPEND register */
#define DMAC_INTPEND_PEND_Pos _UINT16_(15) /* (DMAC_INTPEND) Pending Position */
#define DMAC_INTPEND_PEND_Msk (_UINT16_(0x1) << DMAC_INTPEND_PEND_Pos) /* (DMAC_INTPEND) Pending Mask */
#define DMAC_INTPEND_PEND(value)                                                                                       \
        (DMAC_INTPEND_PEND_Msk &                                                                                       \
         (_UINT16_(value) << DMAC_INTPEND_PEND_Pos)) /* Assigment of value for PEND in the DMAC_INTPEND register */
#define DMAC_INTPEND_Msk _UINT16_(0xE70F) /* (DMAC_INTPEND) Register Mask  */


/* -------- DMAC_INTSTATUS : (DMAC Offset: 0x24) ( R/ 32) Interrupt Status -------- */
#define DMAC_INTSTATUS_RESETVALUE _UINT32_(0x00) /*  (DMAC_INTSTATUS) Interrupt Status  Reset Value */

#define DMAC_INTSTATUS_CHINT0_Pos _UINT32_(0) /* (DMAC_INTSTATUS) Channel 0 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT0_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT0_Pos) /* (DMAC_INTSTATUS) Channel 0 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT0(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT0_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT0_Pos)) /* Assigment of value for CHINT0 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT1_Pos _UINT32_(1) /* (DMAC_INTSTATUS) Channel 1 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT1_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT1_Pos) /* (DMAC_INTSTATUS) Channel 1 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT1(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT1_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT1_Pos)) /* Assigment of value for CHINT1 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT2_Pos _UINT32_(2) /* (DMAC_INTSTATUS) Channel 2 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT2_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT2_Pos) /* (DMAC_INTSTATUS) Channel 2 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT2(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT2_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT2_Pos)) /* Assigment of value for CHINT2 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT3_Pos _UINT32_(3) /* (DMAC_INTSTATUS) Channel 3 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT3_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT3_Pos) /* (DMAC_INTSTATUS) Channel 3 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT3(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT3_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT3_Pos)) /* Assigment of value for CHINT3 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT4_Pos _UINT32_(4) /* (DMAC_INTSTATUS) Channel 4 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT4_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT4_Pos) /* (DMAC_INTSTATUS) Channel 4 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT4(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT4_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT4_Pos)) /* Assigment of value for CHINT4 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT5_Pos _UINT32_(5) /* (DMAC_INTSTATUS) Channel 5 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT5_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT5_Pos) /* (DMAC_INTSTATUS) Channel 5 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT5(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT5_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT5_Pos)) /* Assigment of value for CHINT5 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT6_Pos _UINT32_(6) /* (DMAC_INTSTATUS) Channel 6 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT6_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT6_Pos) /* (DMAC_INTSTATUS) Channel 6 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT6(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT6_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT6_Pos)) /* Assigment of value for CHINT6 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT7_Pos _UINT32_(7) /* (DMAC_INTSTATUS) Channel 7 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT7_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT7_Pos) /* (DMAC_INTSTATUS) Channel 7 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT7(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT7_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT7_Pos)) /* Assigment of value for CHINT7 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT8_Pos _UINT32_(8) /* (DMAC_INTSTATUS) Channel 8 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT8_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT8_Pos) /* (DMAC_INTSTATUS) Channel 8 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT8(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT8_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT8_Pos)) /* Assigment of value for CHINT8 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT9_Pos _UINT32_(9) /* (DMAC_INTSTATUS) Channel 9 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT9_Msk                                                                                      \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT9_Pos) /* (DMAC_INTSTATUS) Channel 9 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT9(value)                                                                                   \
        (DMAC_INTSTATUS_CHINT9_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT9_Pos)) /* Assigment of value for CHINT9 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT10_Pos _UINT32_(10) /* (DMAC_INTSTATUS) Channel 10 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT10_Msk                                                                                     \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT10_Pos) /* (DMAC_INTSTATUS) Channel 10 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT10(value)                                                                                  \
        (DMAC_INTSTATUS_CHINT10_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT10_Pos)) /* Assigment of value for CHINT10 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_CHINT11_Pos _UINT32_(11) /* (DMAC_INTSTATUS) Channel 11 Pending Interrupt Position */
#define DMAC_INTSTATUS_CHINT11_Msk                                                                                     \
        (_UINT32_(0x1) << DMAC_INTSTATUS_CHINT11_Pos) /* (DMAC_INTSTATUS) Channel 11 Pending Interrupt Mask */
#define DMAC_INTSTATUS_CHINT11(value)                                                                                  \
        (DMAC_INTSTATUS_CHINT11_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << DMAC_INTSTATUS_CHINT11_Pos)) /* Assigment of value for CHINT11 in the DMAC_INTSTATUS register */
#define DMAC_INTSTATUS_Msk _UINT32_(0x00000FFF) /* (DMAC_INTSTATUS) Register Mask  */

