ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
#define DMAC_INTSTATUS_CHINT_Pos _UINT32_(0) /* (DMAC_INTSTATUS Position) Channel xx Pending Interrupt */
#define DMAC_INTSTATUS_CHINT_Msk (_UINT32_(0xFFF) << DMAC_INTSTATUS_CHINT_Pos) /* (DMAC_INTSTATUS Mask) CHINT */
#define DMAC_INTSTATUS_CHINT(value) (DMAC_INTSTATUS_CHINT_Msk & (_UINT32_(value) << DMAC_INTSTATUS_CHINT_Pos))

/* -------- DMAC_BUSYCH : (DMAC Offset: 0x28) ( R/ 32) Busy Channels -------- */
#define DMAC_BUSYCH_RESETVALUE _UINT32_(0x00) /*  (DMAC_BUSYCH) Busy Channels  Reset Value */

#define DMAC_BUSYCH_BUSYCH0_Pos _UINT32_(0) /* (DMAC_BUSYCH) Busy Channel 0 Position */
#define DMAC_BUSYCH_BUSYCH0_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH0_Pos) /* (DMAC_BUSYCH) Busy Channel 0 Mask */
#define DMAC_BUSYCH_BUSYCH0(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH0_Pos)) /* Assigment of value for BUSYCH0 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH1_Pos _UINT32_(1) /* (DMAC_BUSYCH) Busy Channel 1 Position */
#define DMAC_BUSYCH_BUSYCH1_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH1_Pos) /* (DMAC_BUSYCH) Busy Channel 1 Mask */
#define DMAC_BUSYCH_BUSYCH1(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH1_Pos)) /* Assigment of value for BUSYCH1 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH2_Pos _UINT32_(2) /* (DMAC_BUSYCH) Busy Channel 2 Position */
#define DMAC_BUSYCH_BUSYCH2_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH2_Pos) /* (DMAC_BUSYCH) Busy Channel 2 Mask */
#define DMAC_BUSYCH_BUSYCH2(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH2_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH2_Pos)) /* Assigment of value for BUSYCH2 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH3_Pos _UINT32_(3) /* (DMAC_BUSYCH) Busy Channel 3 Position */
#define DMAC_BUSYCH_BUSYCH3_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH3_Pos) /* (DMAC_BUSYCH) Busy Channel 3 Mask */
#define DMAC_BUSYCH_BUSYCH3(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH3_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH3_Pos)) /* Assigment of value for BUSYCH3 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH4_Pos _UINT32_(4) /* (DMAC_BUSYCH) Busy Channel 4 Position */
#define DMAC_BUSYCH_BUSYCH4_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH4_Pos) /* (DMAC_BUSYCH) Busy Channel 4 Mask */
#define DMAC_BUSYCH_BUSYCH4(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH4_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH4_Pos)) /* Assigment of value for BUSYCH4 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH5_Pos _UINT32_(5) /* (DMAC_BUSYCH) Busy Channel 5 Position */
#define DMAC_BUSYCH_BUSYCH5_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH5_Pos) /* (DMAC_BUSYCH) Busy Channel 5 Mask */
#define DMAC_BUSYCH_BUSYCH5(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH5_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH5_Pos)) /* Assigment of value for BUSYCH5 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH6_Pos _UINT32_(6) /* (DMAC_BUSYCH) Busy Channel 6 Position */
#define DMAC_BUSYCH_BUSYCH6_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH6_Pos) /* (DMAC_BUSYCH) Busy Channel 6 Mask */
#define DMAC_BUSYCH_BUSYCH6(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH6_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH6_Pos)) /* Assigment of value for BUSYCH6 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH7_Pos _UINT32_(7) /* (DMAC_BUSYCH) Busy Channel 7 Position */
#define DMAC_BUSYCH_BUSYCH7_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH7_Pos) /* (DMAC_BUSYCH) Busy Channel 7 Mask */
#define DMAC_BUSYCH_BUSYCH7(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH7_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH7_Pos)) /* Assigment of value for BUSYCH7 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH8_Pos _UINT32_(8) /* (DMAC_BUSYCH) Busy Channel 8 Position */
#define DMAC_BUSYCH_BUSYCH8_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH8_Pos) /* (DMAC_BUSYCH) Busy Channel 8 Mask */
#define DMAC_BUSYCH_BUSYCH8(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH8_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH8_Pos)) /* Assigment of value for BUSYCH8 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH9_Pos _UINT32_(9) /* (DMAC_BUSYCH) Busy Channel 9 Position */
#define DMAC_BUSYCH_BUSYCH9_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH9_Pos) /* (DMAC_BUSYCH) Busy Channel 9 Mask */
#define DMAC_BUSYCH_BUSYCH9(value)                                                                                     \
        (DMAC_BUSYCH_BUSYCH9_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH9_Pos)) /* Assigment of value for BUSYCH9 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH10_Pos _UINT32_(10) /* (DMAC_BUSYCH) Busy Channel 10 Position */
#define DMAC_BUSYCH_BUSYCH10_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH10_Pos) /* (DMAC_BUSYCH) Busy Channel 10 Mask */
#define DMAC_BUSYCH_BUSYCH10(value)                                                                                    \
        (DMAC_BUSYCH_BUSYCH10_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH10_Pos)) /* Assigment of value for BUSYCH10 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_BUSYCH11_Pos _UINT32_(11) /* (DMAC_BUSYCH) Busy Channel 11 Position */
#define DMAC_BUSYCH_BUSYCH11_Msk (_UINT32_(0x1) << DMAC_BUSYCH_BUSYCH11_Pos) /* (DMAC_BUSYCH) Busy Channel 11 Mask */
#define DMAC_BUSYCH_BUSYCH11(value)                                                                                    \
        (DMAC_BUSYCH_BUSYCH11_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_BUSYCH_BUSYCH11_Pos)) /* Assigment of value for BUSYCH11 in the DMAC_BUSYCH register */
#define DMAC_BUSYCH_Msk _UINT32_(0x00000FFF) /* (DMAC_BUSYCH) Register Mask  */

#define DMAC_BUSYCH_BUSYCH_Pos _UINT32_(0) /* (DMAC_BUSYCH Position) Busy Channel xx */
#define DMAC_BUSYCH_BUSYCH_Msk (_UINT32_(0xFFF) << DMAC_BUSYCH_BUSYCH_Pos) /* (DMAC_BUSYCH Mask) BUSYCH */
#define DMAC_BUSYCH_BUSYCH(value) (DMAC_BUSYCH_BUSYCH_Msk & (_UINT32_(value) << DMAC_BUSYCH_BUSYCH_Pos))

