ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/* -------- DMAC_PENDCH : (DMAC Offset: 0x2C) ( R/ 32) Pending Channels -------- */
#define DMAC_PENDCH_RESETVALUE _UINT32_(0x00) /*  (DMAC_PENDCH) Pending Channels  Reset Value */

#define DMAC_PENDCH_PENDCH0_Pos _UINT32_(0) /* (DMAC_PENDCH) Pending Channel 0 Position */
#define DMAC_PENDCH_PENDCH0_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH0_Pos) /* (DMAC_PENDCH) Pending Channel 0 Mask */
#define DMAC_PENDCH_PENDCH0(value)                                                                                     \
        (DMAC_PENDCH_PENDCH0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH0_Pos)) /* Assigment of value for PENDCH0 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH1_Pos _UINT32_(1) /* (DMAC_PENDCH) Pending Channel 1 Position */
#define DMAC_PENDCH_PENDCH1_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH1_Pos) /* (DMAC_PENDCH) Pending Channel 1 Mask */
#define DMAC_PENDCH_PENDCH1(value)                                                                                     \
        (DMAC_PENDCH_PENDCH1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH1_Pos)) /* Assigment of value for PENDCH1 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH2_Pos _UINT32_(2) /* (DMAC_PENDCH) Pending Channel 2 Position */
#define DMAC_PENDCH_PENDCH2_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH2_Pos) /* (DMAC_PENDCH) Pending Channel 2 Mask */
#define DMAC_PENDCH_PENDCH2(value)                                                                                     \
        (DMAC_PENDCH_PENDCH2_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH2_Pos)) /* Assigment of value for PENDCH2 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH3_Pos _UINT32_(3) /* (DMAC_PENDCH) Pending Channel 3 Position */
#define DMAC_PENDCH_PENDCH3_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH3_Pos) /* (DMAC_PENDCH) Pending Channel 3 Mask */
#define DMAC_PENDCH_PENDCH3(value)                                                                                     \
        (DMAC_PENDCH_PENDCH3_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH3_Pos)) /* Assigment of value for PENDCH3 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH4_Pos _UINT32_(4) /* (DMAC_PENDCH) Pending Channel 4 Position */
#define DMAC_PENDCH_PENDCH4_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH4_Pos) /* (DMAC_PENDCH) Pending Channel 4 Mask */
#define DMAC_PENDCH_PENDCH4(value)                                                                                     \
        (DMAC_PENDCH_PENDCH4_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH4_Pos)) /* Assigment of value for PENDCH4 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH5_Pos _UINT32_(5) /* (DMAC_PENDCH) Pending Channel 5 Position */
#define DMAC_PENDCH_PENDCH5_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH5_Pos) /* (DMAC_PENDCH) Pending Channel 5 Mask */
#define DMAC_PENDCH_PENDCH5(value)                                                                                     \
        (DMAC_PENDCH_PENDCH5_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH5_Pos)) /* Assigment of value for PENDCH5 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH6_Pos _UINT32_(6) /* (DMAC_PENDCH) Pending Channel 6 Position */
#define DMAC_PENDCH_PENDCH6_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH6_Pos) /* (DMAC_PENDCH) Pending Channel 6 Mask */
#define DMAC_PENDCH_PENDCH6(value)                                                                                     \
        (DMAC_PENDCH_PENDCH6_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH6_Pos)) /* Assigment of value for PENDCH6 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH7_Pos _UINT32_(7) /* (DMAC_PENDCH) Pending Channel 7 Position */
#define DMAC_PENDCH_PENDCH7_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH7_Pos) /* (DMAC_PENDCH) Pending Channel 7 Mask */
#define DMAC_PENDCH_PENDCH7(value)                                                                                     \
        (DMAC_PENDCH_PENDCH7_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH7_Pos)) /* Assigment of value for PENDCH7 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH8_Pos _UINT32_(8) /* (DMAC_PENDCH) Pending Channel 8 Position */
#define DMAC_PENDCH_PENDCH8_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH8_Pos) /* (DMAC_PENDCH) Pending Channel 8 Mask */
#define DMAC_PENDCH_PENDCH8(value)                                                                                     \
        (DMAC_PENDCH_PENDCH8_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH8_Pos)) /* Assigment of value for PENDCH8 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH9_Pos _UINT32_(9) /* (DMAC_PENDCH) Pending Channel 9 Position */
#define DMAC_PENDCH_PENDCH9_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH9_Pos) /* (DMAC_PENDCH) Pending Channel 9 Mask */
#define DMAC_PENDCH_PENDCH9(value)                                                                                     \
        (DMAC_PENDCH_PENDCH9_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH9_Pos)) /* Assigment of value for PENDCH9 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH10_Pos _UINT32_(10) /* (DMAC_PENDCH) Pending Channel 10 Position */
#define DMAC_PENDCH_PENDCH10_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH10_Pos) /* (DMAC_PENDCH) Pending Channel 10 Mask  \
                                                                              */
#define DMAC_PENDCH_PENDCH10(value)                                                                                    \
        (DMAC_PENDCH_PENDCH10_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH10_Pos)) /* Assigment of value for PENDCH10 in the DMAC_PENDCH register */
#define DMAC_PENDCH_PENDCH11_Pos _UINT32_(11) /* (DMAC_PENDCH) Pending Channel 11 Position */
#define DMAC_PENDCH_PENDCH11_Msk (_UINT32_(0x1) << DMAC_PENDCH_PENDCH11_Pos) /* (DMAC_PENDCH) Pending Channel 11 Mask  \
                                                                              */
#define DMAC_PENDCH_PENDCH11(value)                                                                                    \
        (DMAC_PENDCH_PENDCH11_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_PENDCH_PENDCH11_Pos)) /* Assigment of value for PENDCH11 in the DMAC_PENDCH register */
#define DMAC_PENDCH_Msk _UINT32_(0x00000FFF) /* (DMAC_PENDCH) Register Mask  */

#define DMAC_PENDCH_PENDCH_Pos _UINT32_(0) /* (DMAC_PENDCH Position) Pending Channel xx */
#define DMAC_PENDCH_PENDCH_Msk (_UINT32_(0xFFF) << DMAC_PENDCH_PENDCH_Pos) /* (DMAC_PENDCH Mask) PENDCH */
#define DMAC_PENDCH_PENDCH(value) (DMAC_PENDCH_PENDCH_Msk & (_UINT32_(value) << DMAC_PENDCH_PENDCH_Pos))

/* -------- DMAC_ACTIVE : (DMAC Offset: 0x30) ( R/ 32) Active Channel and Levels -------- */
#define DMAC_ACTIVE_RESETVALUE _UINT32_(0x00) /*  (DMAC_ACTIVE) Active Channel and Levels  Reset Value */

#define DMAC_ACTIVE_LVLEX0_Pos _UINT32_(0) /* (DMAC_ACTIVE) Level 0 Channel Trigger Request Executing Position */
#define DMAC_ACTIVE_LVLEX0_Msk                                                                                         \
        (_UINT32_(0x1) << DMAC_ACTIVE_LVLEX0_Pos) /* (DMAC_ACTIVE) Level 0 Channel Trigger Request Executing Mask */
#define DMAC_ACTIVE_LVLEX0(value)                                                                                      \
        (DMAC_ACTIVE_LVLEX0_Msk &                                                                                      \
         (_UINT32_(value) << DMAC_ACTIVE_LVLEX0_Pos)) /* Assigment of value for LVLEX0 in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_LVLEX1_Pos _UINT32_(1) /* (DMAC_ACTIVE) Level 1 Channel Trigger Request Executing Position */
#define DMAC_ACTIVE_LVLEX1_Msk                                                                                         \
        (_UINT32_(0x1) << DMAC_ACTIVE_LVLEX1_Pos) /* (DMAC_ACTIVE) Level 1 Channel Trigger Request Executing Mask */
#define DMAC_ACTIVE_LVLEX1(value)                                                                                      \
        (DMAC_ACTIVE_LVLEX1_Msk &                                                                                      \
         (_UINT32_(value) << DMAC_ACTIVE_LVLEX1_Pos)) /* Assigment of value for LVLEX1 in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_LVLEX2_Pos _UINT32_(2) /* (DMAC_ACTIVE) Level 2 Channel Trigger Request Executing Position */
#define DMAC_ACTIVE_LVLEX2_Msk                                                                                         \
        (_UINT32_(0x1) << DMAC_ACTIVE_LVLEX2_Pos) /* (DMAC_ACTIVE) Level 2 Channel Trigger Request Executing Mask */
#define DMAC_ACTIVE_LVLEX2(value)                                                                                      \
        (DMAC_ACTIVE_LVLEX2_Msk &                                                                                      \
         (_UINT32_(value) << DMAC_ACTIVE_LVLEX2_Pos)) /* Assigment of value for LVLEX2 in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_LVLEX3_Pos _UINT32_(3) /* (DMAC_ACTIVE) Level 3 Channel Trigger Request Executing Position */
#define DMAC_ACTIVE_LVLEX3_Msk                                                                                         \
        (_UINT32_(0x1) << DMAC_ACTIVE_LVLEX3_Pos) /* (DMAC_ACTIVE) Level 3 Channel Trigger Request Executing Mask */
#define DMAC_ACTIVE_LVLEX3(value)                                                                                      \
        (DMAC_ACTIVE_LVLEX3_Msk &                                                                                      \
         (_UINT32_(value) << DMAC_ACTIVE_LVLEX3_Pos)) /* Assigment of value for LVLEX3 in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_ID_Pos _UINT32_(8) /* (DMAC_ACTIVE) Active Channel ID Position */
#define DMAC_ACTIVE_ID_Msk (_UINT32_(0x1F) << DMAC_ACTIVE_ID_Pos) /* (DMAC_ACTIVE) Active Channel ID Mask */
#define DMAC_ACTIVE_ID(value)                                                                                          \
        (DMAC_ACTIVE_ID_Msk &                                                                                          \
         (_UINT32_(value) << DMAC_ACTIVE_ID_Pos)) /* Assigment of value for ID in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_ABUSY_Pos _UINT32_(15) /* (DMAC_ACTIVE) Active Channel Busy Position */
#define DMAC_ACTIVE_ABUSY_Msk (_UINT32_(0x1) << DMAC_ACTIVE_ABUSY_Pos) /* (DMAC_ACTIVE) Active Channel Busy Mask */
#define DMAC_ACTIVE_ABUSY(value)                                                                                       \
        (DMAC_ACTIVE_ABUSY_Msk &                                                                                       \
         (_UINT32_(value) << DMAC_ACTIVE_ABUSY_Pos)) /* Assigment of value for ABUSY in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_BTCNT_Pos _UINT32_(16) /* (DMAC_ACTIVE) Active Channel Block Transfer Count Position */
#define DMAC_ACTIVE_BTCNT_Msk                                                                                          \
        (_UINT32_(0xFFFF) << DMAC_ACTIVE_BTCNT_Pos) /* (DMAC_ACTIVE) Active Channel Block Transfer Count Mask */
#define DMAC_ACTIVE_BTCNT(value)                                                                                       \
        (DMAC_ACTIVE_BTCNT_Msk &                                                                                       \
         (_UINT32_(value) << DMAC_ACTIVE_BTCNT_Pos)) /* Assigment of value for BTCNT in the DMAC_ACTIVE register */
#define DMAC_ACTIVE_Msk _UINT32_(0xFFFF9F0F) /* (DMAC_ACTIVE) Register Mask  */

#define DMAC_ACTIVE_LVLEX_Pos _UINT32_(0) /* (DMAC_ACTIVE Position) Level x Channel Trigger Request Executing */
#define DMAC_ACTIVE_LVLEX_Msk (_UINT32_(0xF) << DMAC_ACTIVE_LVLEX_Pos) /* (DMAC_ACTIVE Mask) LVLEX */
#define DMAC_ACTIVE_LVLEX(value) (DMAC_ACTIVE_LVLEX_Msk & (_UINT32_(value) << DMAC_ACTIVE_LVLEX_Pos))

/* -------- DMAC_BASEADDR : (DMAC Offset: 0x34) (R/W 32) Descriptor Memory Section Base Address -------- */
#define DMAC_BASEADDR_RESETVALUE                                                                                       \
        _UINT32_(0x00) /*  (DMAC_BASEADDR) Descriptor Memory Section Base Address  Reset Value */

#define DMAC_BASEADDR_BASEADDR_Pos _UINT32_(0) /* (DMAC_BASEADDR) Descriptor Memory Base Address Position */
#define DMAC_BASEADDR_BASEADDR_Msk                                                                                     \
        (_UINT32_(0xFFFFFFFF) << DMAC_BASEADDR_BASEADDR_Pos) /* (DMAC_BASEADDR) Descriptor Memory Base Address Mask */
#define DMAC_BASEADDR_BASEADDR(value)                                                                                  \
        (DMAC_BASEADDR_BASEADDR_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << DMAC_BASEADDR_BASEADDR_Pos)) /* Assigment of value for BASEADDR in the DMAC_BASEADDR register */
#define DMAC_BASEADDR_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_BASEADDR) Register Mask  */


/* -------- DMAC_WRBADDR : (DMAC Offset: 0x38) (R/W 32) Write-Back Memory Section Base Address -------- */
#define DMAC_WRBADDR_RESETVALUE _UINT32_(0x00) /*  (DMAC_WRBADDR) Write-Back Memory Section Base Address  Reset Value  \
                                                */

#define DMAC_WRBADDR_WRBADDR_Pos _UINT32_(0) /* (DMAC_WRBADDR) Write-Back Memory Base Address Position */
#define DMAC_WRBADDR_WRBADDR_Msk                                                                                       \
        (_UINT32_(0xFFFFFFFF) << DMAC_WRBADDR_WRBADDR_Pos) /* (DMAC_WRBADDR) Write-Back Memory Base Address Mask */
#define DMAC_WRBADDR_WRBADDR(value)                                                                                    \
        (DMAC_WRBADDR_WRBADDR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_WRBADDR_WRBADDR_Pos)) /* Assigment of value for WRBADDR in the DMAC_WRBADDR register */
#define DMAC_WRBADDR_Msk _UINT32_(0xFFFFFFFF) /* (DMAC_WRBADDR) Register Mask  */


/* -------- DMAC_CHID : (DMAC Offset: 0x3F) (R/W 8) Channel ID -------- */
#define DMAC_CHID_RESETVALUE _UINT8_(0x00) /*  (DMAC_CHID) Channel ID  Reset Value */

#define DMAC_CHID_ID_Pos _UINT8_(0) /* (DMAC_CHID) Channel ID Position */
#define DMAC_CHID_ID_Msk (_UINT8_(0xF) << DMAC_CHID_ID_Pos) /* (DMAC_CHID) Channel ID Mask */
#define DMAC_CHID_ID(value)                                                                                            \
        (DMAC_CHID_ID_Msk &                                                                                            \
         (_UINT8_(value) << DMAC_CHID_ID_Pos)) /* Assigment of value for ID in the DMAC_CHID register */
#define DMAC_CHID_Msk _UINT8_(0x0F) /* (DMAC_CHID) Register Mask  */


