ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/* -------- DMAC_CHCTRLA : (DMAC Offset: 0x40) (R/W 8) Channel Control A -------- */
#define DMAC_CHCTRLA_RESETVALUE _UINT8_(0x00) /*  (DMAC_CHCTRLA) Channel Control A  Reset Value */

#define DMAC_CHCTRLA_SWRST_Pos _UINT8_(0) /* (DMAC_CHCTRLA) Channel Software Reset Position */
#define DMAC_CHCTRLA_SWRST_Msk (_UINT8_(0x1) << DMAC_CHCTRLA_SWRST_Pos) /* (DMAC_CHCTRLA) Channel Software Reset Mask  \
                                                                         */
#define DMAC_CHCTRLA_SWRST(value)                                                                                      \
        (DMAC_CHCTRLA_SWRST_Msk &                                                                                      \
         (_UINT8_(value) << DMAC_CHCTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the DMAC_CHCTRLA register */
#define DMAC_CHCTRLA_ENABLE_Pos _UINT8_(1) /* (DMAC_CHCTRLA) Channel Enable Position */
#define DMAC_CHCTRLA_ENABLE_Msk (_UINT8_(0x1) << DMAC_CHCTRLA_ENABLE_Pos) /* (DMAC_CHCTRLA) Channel Enable Mask */
#define DMAC_CHCTRLA_ENABLE(value)                                                                                     \
        (DMAC_CHCTRLA_ENABLE_Msk &                                                                                     \
         (_UINT8_(value) << DMAC_CHCTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the DMAC_CHCTRLA register */
#define DMAC_CHCTRLA_Msk _UINT8_(0x03) /* (DMAC_CHCTRLA) Register Mask  */


/* -------- DMAC_CHCTRLB : (DMAC Offset: 0x44) (R/W 32) Channel Control B -------- */
#define DMAC_CHCTRLB_RESETVALUE _UINT32_(0x00) /*  (DMAC_CHCTRLB) Channel Control B  Reset Value */

#define DMAC_CHCTRLB_EVACT_Pos _UINT32_(0) /* (DMAC_CHCTRLB) Event Input Action Position */
#define DMAC_CHCTRLB_EVACT_Msk (_UINT32_(0x7) << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Event Input Action Mask */
#define DMAC_CHCTRLB_EVACT(value)                                                                                      \
        (DMAC_CHCTRLB_EVACT_Msk &                                                                                      \
         (_UINT32_(value) << DMAC_CHCTRLB_EVACT_Pos)) /* Assigment of value for EVACT in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_EVACT_NOACT_Val _UINT32_(0x0) /* (DMAC_CHCTRLB) No action  */
#define DMAC_CHCTRLB_EVACT_TRIG_Val _UINT32_(0x1) /* (DMAC_CHCTRLB) Transfer and periodic transfer trigger  */
#define DMAC_CHCTRLB_EVACT_CTRIG_Val _UINT32_(0x2) /* (DMAC_CHCTRLB) Conditional transfer trigger  */
#define DMAC_CHCTRLB_EVACT_CBLOCK_Val _UINT32_(0x3) /* (DMAC_CHCTRLB) Conditional block transfer  */
#define DMAC_CHCTRLB_EVACT_SUSPEND_Val _UINT32_(0x4) /* (DMAC_CHCTRLB) Channel suspend operation  */
#define DMAC_CHCTRLB_EVACT_RESUME_Val _UINT32_(0x5) /* (DMAC_CHCTRLB) Channel resume operation  */
#define DMAC_CHCTRLB_EVACT_SSKIP_Val _UINT32_(0x6) /* (DMAC_CHCTRLB) Skip next block suspend action  */
#define DMAC_CHCTRLB_EVACT_NOACT                                                                                       \
        (DMAC_CHCTRLB_EVACT_NOACT_Val << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) No action Position  */
#define DMAC_CHCTRLB_EVACT_TRIG                                                                                        \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_TRIG_Val                                                                            \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Transfer and periodic transfer trigger Position  */
#define DMAC_CHCTRLB_EVACT_CTRIG                                                                                       \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_CTRIG_Val                                                                           \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Conditional transfer trigger Position  */
#define DMAC_CHCTRLB_EVACT_CBLOCK                                                                                      \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_CBLOCK_Val                                                                          \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Conditional block transfer Position  */
#define DMAC_CHCTRLB_EVACT_SUSPEND                                                                                     \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_SUSPEND_Val                                                                         \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Channel suspend operation Position  */
#define DMAC_CHCTRLB_EVACT_RESUME                                                                                      \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_RESUME_Val                                                                          \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Channel resume operation Position  */
#define DMAC_CHCTRLB_EVACT_SSKIP                                                                                       \
        (                                                                                                              \
                DMAC_CHCTRLB_EVACT_SSKIP_Val                                                                           \
                << DMAC_CHCTRLB_EVACT_Pos) /* (DMAC_CHCTRLB) Skip next block suspend action Position  */
#define DMAC_CHCTRLB_EVIE_Pos _UINT32_(3) /* (DMAC_CHCTRLB) Channel Event Input Enable Position */
#define DMAC_CHCTRLB_EVIE_Msk                                                                                          \
        (_UINT32_(0x1) << DMAC_CHCTRLB_EVIE_Pos) /* (DMAC_CHCTRLB) Channel Event Input Enable Mask */
#define DMAC_CHCTRLB_EVIE(value)                                                                                       \
        (DMAC_CHCTRLB_EVIE_Msk &                                                                                       \
         (_UINT32_(value) << DMAC_CHCTRLB_EVIE_Pos)) /* Assigment of value for EVIE in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_EVOE_Pos _UINT32_(4) /* (DMAC_CHCTRLB) Channel Event Output Enable Position */
#define DMAC_CHCTRLB_EVOE_Msk                                                                                          \
        (_UINT32_(0x1) << DMAC_CHCTRLB_EVOE_Pos) /* (DMAC_CHCTRLB) Channel Event Output Enable Mask */
#define DMAC_CHCTRLB_EVOE(value)                                                                                       \
        (DMAC_CHCTRLB_EVOE_Msk &                                                                                       \
         (_UINT32_(value) << DMAC_CHCTRLB_EVOE_Pos)) /* Assigment of value for EVOE in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_LVL_Pos _UINT32_(5) /* (DMAC_CHCTRLB) Channel Arbitration Level Position */
#define DMAC_CHCTRLB_LVL_Msk (_UINT32_(0x3) << DMAC_CHCTRLB_LVL_Pos) /* (DMAC_CHCTRLB) Channel Arbitration Level Mask  \
                                                                      */
#define DMAC_CHCTRLB_LVL(value)                                                                                        \
        (DMAC_CHCTRLB_LVL_Msk &                                                                                        \
         (_UINT32_(value) << DMAC_CHCTRLB_LVL_Pos)) /* Assigment of value for LVL in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_LVL_LVL0_Val _UINT32_(0x0) /* (DMAC_CHCTRLB) Channel Priority Level 0  */
#define DMAC_CHCTRLB_LVL_LVL1_Val _UINT32_(0x1) /* (DMAC_CHCTRLB) Channel Priority Level 1  */
#define DMAC_CHCTRLB_LVL_LVL2_Val _UINT32_(0x2) /* (DMAC_CHCTRLB) Channel Priority Level 2  */
#define DMAC_CHCTRLB_LVL_LVL3_Val _UINT32_(0x3) /* (DMAC_CHCTRLB) Channel Priority Level 3  */
#define DMAC_CHCTRLB_LVL_LVL0                                                                                          \
        (DMAC_CHCTRLB_LVL_LVL0_Val << DMAC_CHCTRLB_LVL_Pos) /* (DMAC_CHCTRLB) Channel Priority Level 0 Position  */
#define DMAC_CHCTRLB_LVL_LVL1                                                                                          \
        (DMAC_CHCTRLB_LVL_LVL1_Val << DMAC_CHCTRLB_LVL_Pos) /* (DMAC_CHCTRLB) Channel Priority Level 1 Position  */
#define DMAC_CHCTRLB_LVL_LVL2                                                                                          \
        (DMAC_CHCTRLB_LVL_LVL2_Val << DMAC_CHCTRLB_LVL_Pos) /* (DMAC_CHCTRLB) Channel Priority Level 2 Position  */
#define DMAC_CHCTRLB_LVL_LVL3                                                                                          \
        (DMAC_CHCTRLB_LVL_LVL3_Val << DMAC_CHCTRLB_LVL_Pos) /* (DMAC_CHCTRLB) Channel Priority Level 3 Position  */
#define DMAC_CHCTRLB_TRIGSRC_Pos _UINT32_(8) /* (DMAC_CHCTRLB) Trigger Source Position */
#define DMAC_CHCTRLB_TRIGSRC_Msk (_UINT32_(0x3F) << DMAC_CHCTRLB_TRIGSRC_Pos) /* (DMAC_CHCTRLB) Trigger Source Mask */
#define DMAC_CHCTRLB_TRIGSRC(value)                                                                                    \
        (DMAC_CHCTRLB_TRIGSRC_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_CHCTRLB_TRIGSRC_Pos)) /* Assigment of value for TRIGSRC in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_TRIGSRC_DISABLE_Val _UINT32_(0x0) /* (DMAC_CHCTRLB) Only software/event triggers  */
#define DMAC_CHCTRLB_TRIGSRC_DISABLE                                                                                   \
        (DMAC_CHCTRLB_TRIGSRC_DISABLE_Val                                                                              \
         << DMAC_CHCTRLB_TRIGSRC_Pos) /* (DMAC_CHCTRLB) Only software/event triggers Position  */
#define DMAC_CHCTRLB_TRIGACT_Pos _UINT32_(22) /* (DMAC_CHCTRLB) Trigger Action Position */
#define DMAC_CHCTRLB_TRIGACT_Msk (_UINT32_(0x3) << DMAC_CHCTRLB_TRIGACT_Pos) /* (DMAC_CHCTRLB) Trigger Action Mask */
#define DMAC_CHCTRLB_TRIGACT(value)                                                                                    \
        (DMAC_CHCTRLB_TRIGACT_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << DMAC_CHCTRLB_TRIGACT_Pos)) /* Assigment of value for TRIGACT in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_TRIGACT_BLOCK_Val _UINT32_(0x0) /* (DMAC_CHCTRLB) One trigger required for each block transfer */
#define DMAC_CHCTRLB_TRIGACT_BEAT_Val _UINT32_(0x2) /* (DMAC_CHCTRLB) One trigger required for each beat transfer  */
#define DMAC_CHCTRLB_TRIGACT_TRANSACTION_Val                                                                           \
        _UINT32_(0x3) /* (DMAC_CHCTRLB) One trigger required for each transaction  */
#define DMAC_CHCTRLB_TRIGACT_BLOCK                                                                                     \
        (DMAC_CHCTRLB_TRIGACT_BLOCK_Val                                                                                \
         << DMAC_CHCTRLB_TRIGACT_Pos) /* (DMAC_CHCTRLB) One trigger required for each block transfer Position  */
#define DMAC_CHCTRLB_TRIGACT_BEAT                                                                                      \
        (                                                                                                              \
                DMAC_CHCTRLB_TRIGACT_BEAT_Val                                                                          \
                << DMAC_CHCTRLB_TRIGACT_Pos) /* (DMAC_CHCTRLB) One trigger required for each beat transfer Position */
#define DMAC_CHCTRLB_TRIGACT_TRANSACTION                                                                               \
        (DMAC_CHCTRLB_TRIGACT_TRANSACTION_Val                                                                          \
         << DMAC_CHCTRLB_TRIGACT_Pos) /* (DMAC_CHCTRLB) One trigger required for each transaction Position  */
#define DMAC_CHCTRLB_CMD_Pos _UINT32_(24) /* (DMAC_CHCTRLB) Software Command Position */
#define DMAC_CHCTRLB_CMD_Msk (_UINT32_(0x3) << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) Software Command Mask */
#define DMAC_CHCTRLB_CMD(value)                                                                                        \
        (DMAC_CHCTRLB_CMD_Msk &                                                                                        \
         (_UINT32_(value) << DMAC_CHCTRLB_CMD_Pos)) /* Assigment of value for CMD in the DMAC_CHCTRLB register */
#define DMAC_CHCTRLB_CMD_NOACT_Val _UINT32_(0x0) /* (DMAC_CHCTRLB) No action  */
#define DMAC_CHCTRLB_CMD_SUSPEND_Val _UINT32_(0x1) /* (DMAC_CHCTRLB) Channel suspend operation  */
#define DMAC_CHCTRLB_CMD_RESUME_Val _UINT32_(0x2) /* (DMAC_CHCTRLB) Channel resume operation  */
#define DMAC_CHCTRLB_CMD_NOACT                                                                                         \
        (DMAC_CHCTRLB_CMD_NOACT_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) No action Position  */
#define DMAC_CHCTRLB_CMD_SUSPEND                                                                                       \
        (DMAC_CHCTRLB_CMD_SUSPEND_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) Channel suspend operation Position */
#define DMAC_CHCTRLB_CMD_RESUME                                                                                        \
        (DMAC_CHCTRLB_CMD_RESUME_Val << DMAC_CHCTRLB_CMD_Pos) /* (DMAC_CHCTRLB) Channel resume operation Position  */
#define DMAC_CHCTRLB_Msk _UINT32_(0x03C03F7F) /* (DMAC_CHCTRLB) Register Mask  */


/* -------- DMAC_CHINTENCLR : (DMAC Offset: 0x4C) (R/W 8) Channel Interrupt Enable Clear -------- */
#define DMAC_CHINTENCLR_RESETVALUE _UINT8_(0x00) /*  (DMAC_CHINTENCLR) Channel Interrupt Enable Clear  Reset Value */

#define DMAC_CHINTENCLR_TERR_Pos _UINT8_(0) /* (DMAC_CHINTENCLR) Channel Transfer Error Interrupt Enable Position */
#define DMAC_CHINTENCLR_TERR_Msk                                                                                       \
        (_UINT8_(0x1) << DMAC_CHINTENCLR_TERR_Pos) /* (DMAC_CHINTENCLR) Channel Transfer Error Interrupt Enable Mask   \
                                                    */
#define DMAC_CHINTENCLR_TERR(value)                                                                                    \
        (DMAC_CHINTENCLR_TERR_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENCLR_TERR_Pos)) /* Assigment of value for TERR in the DMAC_CHINTENCLR register */
#define DMAC_CHINTENCLR_TCMPL_Pos _UINT8_(1) /* (DMAC_CHINTENCLR) Channel Transfer Complete Interrupt Enable Position  \
                                              */
#define DMAC_CHINTENCLR_TCMPL_Msk                                                                                      \
        (_UINT8_(0x1)                                                                                                  \
         << DMAC_CHINTENCLR_TCMPL_Pos) /* (DMAC_CHINTENCLR) Channel Transfer Complete Interrupt Enable Mask */
#define DMAC_CHINTENCLR_TCMPL(value)                                                                                   \
        (DMAC_CHINTENCLR_TCMPL_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENCLR_TCMPL_Pos)) /* Assigment of value for TCMPL in the DMAC_CHINTENCLR register */
#define DMAC_CHINTENCLR_SUSP_Pos _UINT8_(2) /* (DMAC_CHINTENCLR) Channel Suspend Interrupt Enable Position */
#define DMAC_CHINTENCLR_SUSP_Msk                                                                                       \
        (_UINT8_(0x1) << DMAC_CHINTENCLR_SUSP_Pos) /* (DMAC_CHINTENCLR) Channel Suspend Interrupt Enable Mask */
#define DMAC_CHINTENCLR_SUSP(value)                                                                                    \
        (DMAC_CHINTENCLR_SUSP_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENCLR_SUSP_Pos)) /* Assigment of value for SUSP in the DMAC_CHINTENCLR register */
#define DMAC_CHINTENCLR_Msk _UINT8_(0x07) /* (DMAC_CHINTENCLR) Register Mask  */


/* -------- DMAC_CHINTENSET : (DMAC Offset: 0x4D) (R/W 8) Channel Interrupt Enable Set -------- */
#define DMAC_CHINTENSET_RESETVALUE _UINT8_(0x00) /*  (DMAC_CHINTENSET) Channel Interrupt Enable Set  Reset Value */

