ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
#define DMAC_CHINTENSET_TERR_Pos _UINT8_(0) /* (DMAC_CHINTENSET) Channel Transfer Error Interrupt Enable Position */
#define DMAC_CHINTENSET_TERR_Msk                                                                                       \
        (_UINT8_(0x1) << DMAC_CHINTENSET_TERR_Pos) /* (DMAC_CHINTENSET) Channel Transfer Error Interrupt Enable Mask   \
                                                    */
#define DMAC_CHINTENSET_TERR(value)                                                                                    \
        (DMAC_CHINTENSET_TERR_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENSET_TERR_Pos)) /* Assigment of value for TERR in the DMAC_CHINTENSET register */
#define DMAC_CHINTENSET_TCMPL_Pos _UINT8_(1) /* (DMAC_CHINTENSET) Channel Transfer Complete Interrupt Enable Position  \
                                              */
#define DMAC_CHINTENSET_TCMPL_Msk                                                                                      \
        (_UINT8_(0x1)                                                                                                  \
         << DMAC_CHINTENSET_TCMPL_Pos) /* (DMAC_CHINTENSET) Channel Transfer Complete Interrupt Enable Mask */
#define DMAC_CHINTENSET_TCMPL(value)                                                                                   \
        (DMAC_CHINTENSET_TCMPL_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENSET_TCMPL_Pos)) /* Assigment of value for TCMPL in the DMAC_CHINTENSET register */
#define DMAC_CHINTENSET_SUSP_Pos _UINT8_(2) /* (DMAC_CHINTENSET) Channel Suspend Interrupt Enable Position */
#define DMAC_CHINTENSET_SUSP_Msk                                                                                       \
        (_UINT8_(0x1) << DMAC_CHINTENSET_SUSP_Pos) /* (DMAC_CHINTENSET) Channel Suspend Interrupt Enable Mask */
#define DMAC_CHINTENSET_SUSP(value)                                                                                    \
        (DMAC_CHINTENSET_SUSP_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTENSET_SUSP_Pos)) /* Assigment of value for SUSP in the DMAC_CHINTENSET register */
#define DMAC_CHINTENSET_Msk _UINT8_(0x07) /* (DMAC_CHINTENSET) Register Mask  */


/* -------- DMAC_CHINTFLAG : (DMAC Offset: 0x4E) (R/W 8) Channel Interrupt Flag Status and Clear -------- */
#define DMAC_CHINTFLAG_RESETVALUE                                                                                      \
        _UINT8_(0x00) /*  (DMAC_CHINTFLAG) Channel Interrupt Flag Status and Clear  Reset Value */

#define DMAC_CHINTFLAG_TERR_Pos _UINT8_(0) /* (DMAC_CHINTFLAG) Channel Transfer Error Position */
#define DMAC_CHINTFLAG_TERR_Msk                                                                                        \
        (_UINT8_(0x1) << DMAC_CHINTFLAG_TERR_Pos) /* (DMAC_CHINTFLAG) Channel Transfer Error Mask */
#define DMAC_CHINTFLAG_TERR(value)                                                                                     \
        (DMAC_CHINTFLAG_TERR_Msk &                                                                                     \
         (_UINT8_(value) << DMAC_CHINTFLAG_TERR_Pos)) /* Assigment of value for TERR in the DMAC_CHINTFLAG register */
#define DMAC_CHINTFLAG_TCMPL_Pos _UINT8_(1) /* (DMAC_CHINTFLAG) Channel Transfer Complete Position */
#define DMAC_CHINTFLAG_TCMPL_Msk                                                                                       \
        (_UINT8_(0x1) << DMAC_CHINTFLAG_TCMPL_Pos) /* (DMAC_CHINTFLAG) Channel Transfer Complete Mask */
#define DMAC_CHINTFLAG_TCMPL(value)                                                                                    \
        (DMAC_CHINTFLAG_TCMPL_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << DMAC_CHINTFLAG_TCMPL_Pos)) /* Assigment of value for TCMPL in the DMAC_CHINTFLAG register */
#define DMAC_CHINTFLAG_SUSP_Pos _UINT8_(2) /* (DMAC_CHINTFLAG) Channel Suspend Position */
#define DMAC_CHINTFLAG_SUSP_Msk (_UINT8_(0x1) << DMAC_CHINTFLAG_SUSP_Pos) /* (DMAC_CHINTFLAG) Channel Suspend Mask */
#define DMAC_CHINTFLAG_SUSP(value)                                                                                     \
        (DMAC_CHINTFLAG_SUSP_Msk &                                                                                     \
         (_UINT8_(value) << DMAC_CHINTFLAG_SUSP_Pos)) /* Assigment of value for SUSP in the DMAC_CHINTFLAG register */
#define DMAC_CHINTFLAG_Msk _UINT8_(0x07) /* (DMAC_CHINTFLAG) Register Mask  */


/* -------- DMAC_CHSTATUS : (DMAC Offset: 0x4F) ( R/ 8) Channel Status -------- */
#define DMAC_CHSTATUS_RESETVALUE _UINT8_(0x00) /*  (DMAC_CHSTATUS) Channel Status  Reset Value */

#define DMAC_CHSTATUS_PEND_Pos _UINT8_(0) /* (DMAC_CHSTATUS) Channel Pending Position */
#define DMAC_CHSTATUS_PEND_Msk (_UINT8_(0x1) << DMAC_CHSTATUS_PEND_Pos) /* (DMAC_CHSTATUS) Channel Pending Mask */
#define DMAC_CHSTATUS_PEND(value)                                                                                      \
        (DMAC_CHSTATUS_PEND_Msk &                                                                                      \
         (_UINT8_(value) << DMAC_CHSTATUS_PEND_Pos)) /* Assigment of value for PEND in the DMAC_CHSTATUS register */
#define DMAC_CHSTATUS_BUSY_Pos _UINT8_(1) /* (DMAC_CHSTATUS) Channel Busy Position */
#define DMAC_CHSTATUS_BUSY_Msk (_UINT8_(0x1) << DMAC_CHSTATUS_BUSY_Pos) /* (DMAC_CHSTATUS) Channel Busy Mask */
#define DMAC_CHSTATUS_BUSY(value)                                                                                      \
        (DMAC_CHSTATUS_BUSY_Msk &                                                                                      \
         (_UINT8_(value) << DMAC_CHSTATUS_BUSY_Pos)) /* Assigment of value for BUSY in the DMAC_CHSTATUS register */
#define DMAC_CHSTATUS_FERR_Pos _UINT8_(2) /* (DMAC_CHSTATUS) Channel Fetch Error Position */
#define DMAC_CHSTATUS_FERR_Msk (_UINT8_(0x1) << DMAC_CHSTATUS_FERR_Pos) /* (DMAC_CHSTATUS) Channel Fetch Error Mask */
#define DMAC_CHSTATUS_FERR(value)                                                                                      \
        (DMAC_CHSTATUS_FERR_Msk &                                                                                      \
         (_UINT8_(value) << DMAC_CHSTATUS_FERR_Pos)) /* Assigment of value for FERR in the DMAC_CHSTATUS register */
#define DMAC_CHSTATUS_Msk _UINT8_(0x07) /* (DMAC_CHSTATUS) Register Mask  */


