ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/dmac.h
/** \brief DMAC register offsets definitions */
#define DMAC_BTCTRL_REG_OFST _UINT32_(0x00) /* (DMAC_BTCTRL) Block Transfer Control Offset */
#define DMAC_BTCNT_REG_OFST _UINT32_(0x02) /* (DMAC_BTCNT) Block Transfer Count Offset */
#define DMAC_SRCADDR_REG_OFST _UINT32_(0x04) /* (DMAC_SRCADDR) Block Transfer Source Address Offset */
#define DMAC_DSTADDR_REG_OFST _UINT32_(0x08) /* (DMAC_DSTADDR) Block Transfer Destination Address Offset */
#define DMAC_DESCADDR_REG_OFST _UINT32_(0x0C) /* (DMAC_DESCADDR) Next Descriptor Address Offset */
#define DMAC_CTRL_REG_OFST _UINT32_(0x00) /* (DMAC_CTRL) Control Offset */
#define DMAC_CRCCTRL_REG_OFST _UINT32_(0x02) /* (DMAC_CRCCTRL) CRC Control Offset */
#define DMAC_CRCDATAIN_REG_OFST _UINT32_(0x04) /* (DMAC_CRCDATAIN) CRC Data Input Offset */
#define DMAC_CRCCHKSUM_REG_OFST _UINT32_(0x08) /* (DMAC_CRCCHKSUM) CRC Checksum Offset */
#define DMAC_CRCSTATUS_REG_OFST _UINT32_(0x0C) /* (DMAC_CRCSTATUS) CRC Status Offset */
#define DMAC_DBGCTRL_REG_OFST _UINT32_(0x0D) /* (DMAC_DBGCTRL) Debug Control Offset */
#define DMAC_QOSCTRL_REG_OFST _UINT32_(0x0E) /* (DMAC_QOSCTRL) QOS Control Offset */
#define DMAC_SWTRIGCTRL_REG_OFST _UINT32_(0x10) /* (DMAC_SWTRIGCTRL) Software Trigger Control Offset */
#define DMAC_PRICTRL0_REG_OFST _UINT32_(0x14) /* (DMAC_PRICTRL0) Priority Control 0 Offset */
#define DMAC_INTPEND_REG_OFST _UINT32_(0x20) /* (DMAC_INTPEND) Interrupt Pending Offset */
#define DMAC_INTSTATUS_REG_OFST _UINT32_(0x24) /* (DMAC_INTSTATUS) Interrupt Status Offset */
#define DMAC_BUSYCH_REG_OFST _UINT32_(0x28) /* (DMAC_BUSYCH) Busy Channels Offset */
#define DMAC_PENDCH_REG_OFST _UINT32_(0x2C) /* (DMAC_PENDCH) Pending Channels Offset */
#define DMAC_ACTIVE_REG_OFST _UINT32_(0x30) /* (DMAC_ACTIVE) Active Channel and Levels Offset */
#define DMAC_BASEADDR_REG_OFST _UINT32_(0x34) /* (DMAC_BASEADDR) Descriptor Memory Section Base Address Offset */
#define DMAC_WRBADDR_REG_OFST _UINT32_(0x38) /* (DMAC_WRBADDR) Write-Back Memory Section Base Address Offset */
#define DMAC_CHID_REG_OFST _UINT32_(0x3F) /* (DMAC_CHID) Channel ID Offset */
#define DMAC_CHCTRLA_REG_OFST _UINT32_(0x40) /* (DMAC_CHCTRLA) Channel Control A Offset */
#define DMAC_CHCTRLB_REG_OFST _UINT32_(0x44) /* (DMAC_CHCTRLB) Channel Control B Offset */
#define DMAC_CHINTENCLR_REG_OFST _UINT32_(0x4C) /* (DMAC_CHINTENCLR) Channel Interrupt Enable Clear Offset */
#define DMAC_CHINTENSET_REG_OFST _UINT32_(0x4D) /* (DMAC_CHINTENSET) Channel Interrupt Enable Set Offset */
#define DMAC_CHINTFLAG_REG_OFST _UINT32_(0x4E) /* (DMAC_CHINTFLAG) Channel Interrupt Flag Status and Clear Offset */
#define DMAC_CHSTATUS_REG_OFST _UINT32_(0x4F) /* (DMAC_CHSTATUS) Channel Status Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief DMAC_DESCRIPTOR register API structure */
typedef struct { /* Direct Memory Access Controller */
        __IO uint16_t DMAC_BTCTRL; /**< Offset: 0x00 (R/W  16) Block Transfer Control */
        __IO uint16_t DMAC_BTCNT; /**< Offset: 0x02 (R/W  16) Block Transfer Count */
        __IO uint32_t DMAC_SRCADDR; /**< Offset: 0x04 (R/W  32) Block Transfer Source Address */
        __IO uint32_t DMAC_DSTADDR; /**< Offset: 0x08 (R/W  32) Block Transfer Destination Address */
        __IO uint32_t DMAC_DESCADDR; /**< Offset: 0x0C (R/W  32) Next Descriptor Address */
} dmac_descriptor_registers_t
#ifdef __GNUC__
        __attribute__((aligned(8)))
#endif
        ;

/** \brief DMAC register API structure */
typedef struct { /* Direct Memory Access Controller */
        __IO uint16_t DMAC_CTRL; /**< Offset: 0x00 (R/W  16) Control */
        __IO uint16_t DMAC_CRCCTRL; /**< Offset: 0x02 (R/W  16) CRC Control */
        __IO uint32_t DMAC_CRCDATAIN; /**< Offset: 0x04 (R/W  32) CRC Data Input */
        __IO uint32_t DMAC_CRCCHKSUM; /**< Offset: 0x08 (R/W  32) CRC Checksum */
        __IO uint8_t DMAC_CRCSTATUS; /**< Offset: 0x0C (R/W  8) CRC Status */
        __IO uint8_t DMAC_DBGCTRL; /**< Offset: 0x0D (R/W  8) Debug Control */
        __IO uint8_t DMAC_QOSCTRL; /**< Offset: 0x0E (R/W  8) QOS Control */
        __I uint8_t Reserved1[0x01];
        __IO uint32_t DMAC_SWTRIGCTRL; /**< Offset: 0x10 (R/W  32) Software Trigger Control */
        __IO uint32_t DMAC_PRICTRL0; /**< Offset: 0x14 (R/W  32) Priority Control 0 */
        __I uint8_t Reserved2[0x08];
        __IO uint16_t DMAC_INTPEND; /**< Offset: 0x20 (R/W  16) Interrupt Pending */
        __I uint8_t Reserved3[0x02];
        __I uint32_t DMAC_INTSTATUS; /**< Offset: 0x24 (R/   32) Interrupt Status */
        __I uint32_t DMAC_BUSYCH; /**< Offset: 0x28 (R/   32) Busy Channels */
        __I uint32_t DMAC_PENDCH; /**< Offset: 0x2C (R/   32) Pending Channels */
        __I uint32_t DMAC_ACTIVE; /**< Offset: 0x30 (R/   32) Active Channel and Levels */
        __IO uint32_t DMAC_BASEADDR; /**< Offset: 0x34 (R/W  32) Descriptor Memory Section Base Address */
        __IO uint32_t DMAC_WRBADDR; /**< Offset: 0x38 (R/W  32) Write-Back Memory Section Base Address */
        __I uint8_t Reserved4[0x03];
        __IO uint8_t DMAC_CHID; /**< Offset: 0x3F (R/W  8) Channel ID */
        __IO uint8_t DMAC_CHCTRLA; /**< Offset: 0x40 (R/W  8) Channel Control A */
        __I uint8_t Reserved5[0x03];
        __IO uint32_t DMAC_CHCTRLB; /**< Offset: 0x44 (R/W  32) Channel Control B */
        __I uint8_t Reserved6[0x04];
        __IO uint8_t DMAC_CHINTENCLR; /**< Offset: 0x4C (R/W  8) Channel Interrupt Enable Clear */
        __IO uint8_t DMAC_CHINTENSET; /**< Offset: 0x4D (R/W  8) Channel Interrupt Enable Set */
        __IO uint8_t DMAC_CHINTFLAG; /**< Offset: 0x4E (R/W  8) Channel Interrupt Flag Status and Clear */
        __I uint8_t DMAC_CHSTATUS; /**< Offset: 0x4F (R/   8) Channel Status */
} dmac_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
/** \brief DMAC_DESCRIPTOR memory section attribute */
#define SECTION_DMAC_DESCRIPTOR

#endif /* _SAMD21_DMAC_COMPONENT_H_ */
